import { store } from "@/store";
import BusinessFormAPI, { type BusinessReportQuery } from "@/api/businessForm";
import { ref, computed } from "vue";
import {
  type MonthCache,
  type YearCache,
  initCache,
  initCacheByData,
  clearCache,
  queryOrgData,
  queryProductTypeData,
  queryCompanyData,
  queryOrgAndProductTypeData,
  queryProductData,
  queryAggData,
  type AggregatedData,
} from "@/store/utils/agg-utils";
import {
  storageData,
  type StorageMonthCache,
  type StorageYearCache,
  clearStorageCache,
  initStorageCache,
} from "@/store/utils/storage-agg-utils";
import {
  initCache as initContractCache,
  clearContractYearCache,
  clearContractMonthCache,
  type ContractMonthCache,
  type ContractYearCache,
  queryAggregateContractData,
} from "@/store/utils/contract-utils";

const queryForm: Ref<Partial<BusinessReportQuery> & PageQueryDev> = ref({
  业务维度: undefined,
  状态集合: undefined,
  日期早于: undefined,
  日期晚于: undefined,
  id集合: undefined,
  页码: 1,
  页容量: 10000,
});

// 数据结果
interface TimeSpanDataResult {
  // 时间维度
  timeSpan: any;
  // 时间
  dataTime: string;
  // 指标
  keyIndexType: string;
  // 组织名
  org: string;
  // 产品类型
  productType?: string;
  // 产品细项
  product?: string;
  // 当期计划值 当期实际值 累计值 环比 同比增长 同比增幅
  plan: number;
  real: number;
  accumulated: number;
  pOverPRate: number;
  pOverPValue: number;
  pToPRate: number;
  pToPValue: number;
  // 下属企业数据；产品数据；下属时间段数据
  subOrg?: TimeSpanDataResult[];
  subProduct?: TimeSpanDataResult[]; // 对企业是产品类型，对产品是分项产品
  subData?: TimeSpanDataResult[];
}

// 要考虑时间维度如何做聚合，当前简化形式需要能很好地在迭代中比较
// 更合理做法是key不用直接的时间而是用标准时间放在value中，每个数据其实是一行
// "行"的标识应该和数据库一样像是uuid/id，时间只是一个索引
// 此处先简化实现，如果用mongo等进行维护则再修改

const cpyMonthTarget = 83333;
const yyMonthTarget = 225000;
const rlyMonthTarget = 33333;
const cpyProfitMonthTarget = 3125;
const yyProfitMonthTarget = 1700;
const rlyProfitMonthTarget = 1000;

// key是指标名
export const revenueData = {
  营收: {
    "2024-01": {
      广投石化本部: {
        "#92汽油": {
          组织名: "广投石化本部",
          数据时间: "2024-01",
          数据类型: "月度",
          当期计划值: 50,
          当期实际值: 55,
          年累计值: 105,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2024-12": {
      广投石化本部: {
        成品油: {
          组织名: "广投石化本部",
          数据时间: "2024-12",
          数据类型: "月度",
          当期计划值: 100,
          当期实际值: 105,
          年累计值: 105,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-01": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 90434.86,
          年累计值: 90434.86,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: yyMonthTarget,
          // 当期实际值: 165436.7,
          当期实际值: 165436.7, // 特殊改动
          年累计值: 165436.7,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: rlyMonthTarget,
          当期实际值: 43247.13,
          年累计值: 43247.13,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 3277.04,
          年累计值: 3277.04,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 218.76,
          年累计值: 218.76,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      内部抵消: {
        内部抵消: {
          组织名: "内部抵消",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -2604.34,
          年累计值: -2604.34,
          环比: 0,
          同比增长: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 3691.19,
          年累计值: 3691.19,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 65000.0,
          当期实际值: 27398.22,
          年累计值: 27398.22,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-02": {
      广投石化本部: {
        // "#92汽油": {
        //   组织名: "广投石化本部",
        //   数据时间: "2025-02",
        //   数据类型: "月度",
        //   当期计划值: 110,
        //   当期实际值: 118,
        //   年累计值: 230,
        //   环比: 0,
        //   同比增长: 0,
        //   同比增幅: 0,
        // },
        // "#95汽油": {
        //   组织名: "广投石化本部",
        //   数据时间: "2025-02",
        //   数据类型: "月度",
        //   当期计划值: 90,
        //   当期实际值: 96,
        //   年累计值: 188,
        //   环比: 0,
        //   同比增长: 0,
        //   同比增幅: 0,
        // },
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 69957.0,
          年累计值: 160391.86,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: yyMonthTarget,
          当期实际值: 391031.58,
          年累计值: 556468.28,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: rlyMonthTarget,
          当期实际值: 14952.72,
          年累计值: 58199.85,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 5549.15,
          年累计值: 8826.18,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 217.92,
          年累计值: 436.68,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0.35,
          年累计值: 0.35,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      内部抵消: {
        内部抵消: {
          组织名: "内部抵消",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -3057.98,
          年累计值: -6112.32,
          环比: 0,
          同比增长: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1680.8,
          年累计值: 6993.82,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 65000,
          当期实际值: 58298.49,
          年累计值: 85696.71,
          环比: 0,
          同比增长: 407,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 106655.07,
          年累计值: 267046.93,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: yyMonthTarget,
          当期实际值: 242931.04,
          年累计值: 799399.32,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: rlyMonthTarget,
          当期实际值: 27172.48,
          年累计值: 85372.33,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 4077.16,
          年累计值: 12903.34,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 217.09,
          年累计值: 653.77,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 59.18,
          年累计值: 59.54,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      内部抵消: {
        内部抵消: {
          组织名: "内部抵消",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -3155.74,
          年累计值: -9268.06,
          环比: 0,
          同比增长: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 20548.58,
          年累计值: 27542.41,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 65000.0,
          当期实际值: 19419.14,
          年累计值: 105115.85,
          环比: 0,
          同比增长: -2,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 99037.17,
          年累计值: 366084.1,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: yyMonthTarget,
          当期实际值: 290855.88,
          年累计值: 1090255.2,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: rlyMonthTarget,
          当期实际值: -155.97,
          年累计值: 85216.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 3729.29,
          年累计值: 16632.63,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 217.93,
          年累计值: 871.7,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 59.54,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      内部抵消: {
        内部抵消: {
          组织名: "内部抵消",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -3051.8,
          年累计值: -12319.87,
          环比: 0,
          同比增长: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 2726.64,
          年累计值: 30269.05,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 65000.0,
          当期实际值: 18144.0,
          年累计值: 123259.85,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 95713.07,
          年累计值: 461797.17,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: yyMonthTarget,
          当期实际值: 198790.57,
          年累计值: 1289045.77,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: rlyMonthTarget,
          当期实际值: -12.04,
          年累计值: 85204.32,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 3359.23,
          年累计值: 19991.86,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 217.92,
          年累计值: 1089.62,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 59.54,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      内部抵消: {
        内部抵消: {
          组织名: "内部抵消",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -3662.31,
          年累计值: -15982.18,
          环比: 0,
          同比增长: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 2306.65,
          年累计值: 32575.7,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 28560.0,
          当期实际值: 22017.73,
          年累计值: 145277.58,
          环比: 0,
          同比增长: -28,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
  },
  利润: {
    "2025-01": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: cpyProfitMonthTarget,
          当期实际值: 2138.13,
          年累计值: 2138.13,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: yyProfitMonthTarget,
          当期实际值: -930.39,
          年累计值: -930.39,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: rlyProfitMonthTarget,
          当期实际值: 851.29,
          年累计值: 851.29,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 8.9,
          年累计值: 8.9,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 653.24,
          年累计值: 653.24,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-02": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: cpyProfitMonthTarget,
          当期实际值: -314.29,
          年累计值: 1823.84,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: yyProfitMonthTarget,
          当期实际值: 1188.87,
          年累计值: 258.48,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: rlyProfitMonthTarget,
          当期实际值: -279.69,
          年累计值: 571.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -570.87,
          年累计值: -570.87,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 59.98,
          年累计值: 59.98,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -2.79,
          年累计值: -2.79,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 22.3,
          年累计值: 31.2,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -237.71,
          年累计值: 415.53,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: cpyProfitMonthTarget,
          当期实际值: -1360.59,
          年累计值: 463.25,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: yyProfitMonthTarget,
          当期实际值: 2827.67,
          年累计值: 3086.15,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: rlyProfitMonthTarget,
          当期实际值: 916.54,
          年累计值: 1488.14,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -130.89,
          年累计值: -701.76,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 22.74,
          年累计值: 82.72,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        原油类产品: {
          组织名: "广投石化舟山",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 196.79,
          年累计值: 194,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 229.63,
          年累计值: 260.83,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 852.05,
          年累计值: 1267.58,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: cpyProfitMonthTarget,
          当期实际值: -563.32,
          年累计值: -100.07,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: yyProfitMonthTarget,
          当期实际值: 2680.99,
          年累计值: 5767.14,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: rlyProfitMonthTarget,
          当期实际值: 894.28,
          年累计值: 2382.42,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -656.93,
          年累计值: -1358.69,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 25.05,
          年累计值: 107.77,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        原油类产品: {
          组织名: "广投石化舟山",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -193.97,
          年累计值: 0.03,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 61.75,
          年累计值: 322.58,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 121.97,
          年累计值: 1389.55,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: cpyProfitMonthTarget,
          当期实际值: -2220.9,
          年累计值: -2320.97,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: yyProfitMonthTarget,
          当期实际值: 3348.0,
          年累计值: 9115.14,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: rlyProfitMonthTarget,
          当期实际值: -184.4,
          年累计值: 2198.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 762.1,
          年累计值: -596.59,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛仓储: {
        仓储业务: {
          组织名: "永盛仓储",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 29.48,
          年累计值: 137.25,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0.02,
          年累计值: 0.05,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 75.9,
          年累计值: 398.48,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 1389.55,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
  },
  采购量: {
    "2025-01": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 12.31,
          年累计值: 12.31,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 42.15,
          年累计值: 42.15,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7.98,
          年累计值: 7.98,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      // 广投石化广东分公司: {
      //   "#92汽油": {
      //     组织名: "广投石化广东分公司",
      //     数据时间: "2025-01",
      //     数据类型: "月度",
      //     当期计划值: 80,
      //     当期实际值: 85,
      //     年累计值: 85,
      //     环比: 0,
      //     同比增长: 0,
      //     同比增幅: 0,
      //   },
      //   "#95汽油": {
      //     组织名: "广投石化广东分公司",
      //     数据时间: "2025-01",
      //     数据类型: "月度",
      //     当期计划值: 60,
      //     当期实际值: 65,
      //     年累计值: 65,
      //     环比: 0,
      //     同比增长: 0,
      //     同比增幅: 0,
      //   },
      //   "#0柴油": {
      //     组织名: "广投石化广东分公司",
      //     数据时间: "2025-01",
      //     数据类型: "月度",
      //     当期计划值: 90,
      //     当期实际值: 95,
      //     年累计值: 95,
      //     环比: 0,
      //     同比增长: 0,
      //     同比增幅: 0,
      //   },
      // },
    },
    "2025-02": {
      广投石化本部: {
        // "#92汽油": {
        //   组织名: "广投石化本部",
        //   数据时间: "2025-02",
        //   数据类型: "月度",
        //   当期计划值: 110,
        //   当期实际值: 118,
        //   年累计值: 230,
        //   环比: 0,
        //   同比增长: 0,
        //   同比增幅: 0,
        // },
        // "#95汽油": {
        //   组织名: "广投石化本部",
        //   数据时间: "2025-02",
        //   数据类型: "月度",
        //   当期计划值: 90,
        //   当期实际值: 96,
        //   年累计值: 188,
        //   环比: 0,
        //   同比增长: 0,
        //   同比增幅: 0,
        // },
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 13.94,
          年累计值: 26.25,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100.59,
          年累计值: 142.74,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 2.94,
          年累计值: 10.92,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 17.18,
          年累计值: 43.43,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 71.53,
          年累计值: 214.27,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 5.04,
          年累计值: 15.96,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 16.76,
          年累计值: 60.19,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 78.22,
          年累计值: 292.49,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 15.96,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 16.96,
          年累计值: 77.15,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 354.28,
          年累计值: 646.77,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 15.96,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
  },
  采购金额: {
    "2025-01": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 74708.6,
          年累计值: 74708.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 164708.36,
          年累计值: 164708.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 41885.19,
          年累计值: 41885.19,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7550.45,
          年累计值: 7550.45,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 35945.5,
          年累计值: 35945.5,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-02": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 85849.83,
          年累计值: 160558.43,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 385748.8,
          年累计值: 550457.16,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 15232.41,
          年累计值: 57117.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 5806.45,
          年累计值: 13356.9,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 56995.43,
          年累计值: 92940.94,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 108041.84,
          年累计值: 268600.27,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 238320.51,
          年累计值: 788777.67,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 26115.13,
          年累计值: 83232.73,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 135540.52,
          年累计值: 148897.42,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 40098.24,
          年累计值: 133039.18,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100135.75,
          年累计值: 368736.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 287473.35,
          年累计值: 1076251.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -1901.01,
          年累计值: 81331.72,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 63930.65,
          年累计值: 212828.07,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 25086.81,
          年累计值: 158125.99,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100561.66,
          年累计值: 469297.68,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 189898.83,
          年累计值: 1266149.85,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7.64,
          年累计值: 81339.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 50856.55,
          年累计值: 263684.62,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 21171.68,
          年累计值: 179297.67,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
  },
  销售量: {
    "2025-01": {
      广投石化本部: {
        成品油: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 12.31,
          年累计值: 12.31,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 42.15,
          年累计值: 42.15,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7.98,
          年累计值: 7.98,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      // 广投石化广东分公司: {
      //   "#92汽油": {
      //     组织名: "广投石化广东分公司",
      //     数据时间: "2025-01",
      //     数据类型: "月度",
      //     当期计划值: 80,
      //     当期实际值: 85,
      //     年累计值: 85,
      //     环比: 0,
      //     同比增长: 0,
      //     同比增幅: 0,
      //   },
      //   "#95汽油": {
      //     组织名: "广投石化广东分公司",
      //     数据时间: "2025-01",
      //     数据类型: "月度",
      //     当期计划值: 60,
      //     当期实际值: 65,
      //     年累计值: 65,
      //     环比: 0,
      //     同比增长: 0,
      //     同比增幅: 0,
      //   },
      //   "#0柴油": {
      //     组织名: "广投石化广东分公司",
      //     数据时间: "2025-01",
      //     数据类型: "月度",
      //     当期计划值: 90,
      //     当期实际值: 95,
      //     年累计值: 95,
      //     环比: 0,
      //     同比增长: 0,
      //     同比增幅: 0,
      //   },
      // },
    },
    "2025-02": {
      广投石化本部: {
        // "#92汽油": {
        //   组织名: "广投石化本部",
        //   数据时间: "2025-02",
        //   数据类型: "月度",
        //   当期计划值: 110,
        //   当期实际值: 118,
        //   年累计值: 230,
        //   环比: 0,
        //   同比增长: 0,
        //   同比增幅: 0,
        // },
        // "#95汽油": {
        //   组织名: "广投石化本部",
        //   数据时间: "2025-02",
        //   数据类型: "月度",
        //   当期计划值: 90,
        //   当期实际值: 96,
        //   年累计值: 188,
        //   环比: 0,
        //   同比增长: 0,
        //   同比增幅: 0,
        // },
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 13.94,
          年累计值: 26.25,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100.59,
          年累计值: 142.74,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 2.94,
          年累计值: 10.92,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: cpyMonthTarget,
          当期实际值: 17.18,
          年累计值: 43.43,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 71.53,
          年累计值: 214.27,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 5.04,
          年累计值: 15.96,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 16.76,
          年累计值: 60.19,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 78.22,
          年累计值: 292.49,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 15.96,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 16.96,
          年累计值: 77.15,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 354.28,
          年累计值: 646.77,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 15.96,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
  },
  销售金额: {
    "2025-01": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 74708.6,
          年累计值: 74708.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 164708.36,
          年累计值: 164708.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 41885.19,
          年累计值: 41885.19,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      永盛石化: {
        成品油产品: {
          组织名: "永盛石化",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      广投石化舟山: {
        船加油: {
          组织名: "广投石化舟山",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7569.65,
          年累计值: 7569.65,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 30835.9,
          年累计值: 30835.9,
          环比: 0,
          同比增长: 160,
          同比增幅: 0,
        },
      },
    },
    "2025-02": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 85849.83,
          年累计值: 160558.43,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 385748.8,
          年累计值: 550457.16,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 15232.41,
          年累计值: 57117.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 4854.67,
          年累计值: 12424.32,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 65005.83,
          年累计值: 95841.72,
          环比: 0,
          同比增长: 396,
          同比增幅: 0,
        },
        恒润公司业务2: {
          组织名: "恒润公司",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 108041.84,
          年累计值: 268600.27,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 238320.51,
          年累计值: 788777.67,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 26115.13,
          年累计值: 83232.73,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 137596.81,
          年累计值: 150021.13,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 21531.71,
          年累计值: 117373.43,
          环比: 0,
          同比增长: -3,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100135.75,
          年累计值: 368736.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 287473.35,
          年累计值: 1076251.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -1901.01,
          年累计值: 81331.72,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 32925.59,
          年累计值: 182946.72,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 20462.71,
          年累计值: 137836.14,
          环比: 0,
          同比增长: -28,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100561.66,
          年累计值: 469297.68,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 189898.83,
          年累计值: 1266149.85,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7.64,
          年累计值: 81339.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      桂盛桂轩: {
        桂盛桂轩业务1: {
          组织名: "桂盛桂轩",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 78088.38,
          年累计值: 261035.1,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        桂盛桂轩业务2: {
          组织名: "桂盛桂轩",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 0,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
      恒润公司: {
        恒润公司业务1: {
          组织名: "恒润公司",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 21507.5,
          年累计值: 159343.64,
          环比: 0,
          同比增长: 17,
          同比增幅: 0,
        },
      },
    },
  },
  固定成本: {
    "2025-01": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 74708.6,
          年累计值: 74708.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 164708.36,
          年累计值: 164708.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 41885.19,
          年累计值: 41885.19,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-02": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 85849.83,
          年累计值: 160558.43,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 385748.8,
          年累计值: 550457.16,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-02",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 15232.41,
          年累计值: 57117.6,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-03": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 108041.84,
          年累计值: 268600.27,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 238320.51,
          年累计值: 788777.67,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-03",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 26115.13,
          年累计值: 83232.73,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-04": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100135.75,
          年累计值: 368736.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 287473.35,
          年累计值: 1076251.02,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-04",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -1901.01,
          年累计值: 81331.72,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
    "2025-05": {
      广投石化本部: {
        成品油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 100561.66,
          年累计值: 469297.68,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        原油产品: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 189898.83,
          年累计值: 1266149.85,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
        燃料油: {
          组织名: "广投石化本部",
          数据时间: "2025-05",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7.64,
          年累计值: 81339.36,
          环比: 0,
          同比增长: 0,
          同比增幅: 0,
        },
      },
    },
  },
  企业资金: {
    "2025-01": {
      广投石化本部: {
        货币资金: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 7.78,
          年累计值: 1,
          环比: 0,
        },
        金融资产: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1.48,
          年累计值: 1,
          环比: 0,
        },
        其他应收: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 8.36,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        长期应收: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0.11,
          年累计值: 1,
          环比: 0,
        },
        资产占用: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 8.24,
          年累计值: 1,
          环比: 0,
        },
        存货: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 24.91,
          年累计值: 1,
          环比: 0,
        },
        应收款项: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 17.18,
          年累计值: 1,
          环比: 0,
        },
        预付款项: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 9.65,
          年累计值: 1,
          环比: 0,
        },
        占用下游客商资金: {
          组织名: "广投石化本部",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: -23.94,
          年累计值: 1,
          环比: 0,
        },
      },
      桂盛桂轩: {
        货币资金: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0.22,
          年累计值: 1,
          环比: 0,
        },
        金融资产: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 1,
          环比: 0,
        },
        其他应收: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 1,
          环比: 0,
        },
        长期应收: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 1,
          环比: 0,
        },
        资产占用: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 1,
          环比: 0,
        },
        存货: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0.09,
          年累计值: 1,
          环比: 0,
        },
        应收款项: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0.22,
          年累计值: 1,
          环比: 0,
        },
        预付款项: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 2.25,
          年累计值: 1,
          环比: 0,
        },
        占用下游客商资金: {
          组织名: "桂盛桂轩",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 0,
          年累计值: 1,
          环比: 0,
        },
      },
      恒润公司: {
        货币资金: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        金融资产: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        其他应收: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        长期应收: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        资产占用: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        存货: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        应收款项: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        预付款项: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
        占用下游客商资金: {
          组织名: "恒润公司",
          数据时间: "2025-01",
          数据类型: "月度",
          当期计划值: 0,
          当期实际值: 1,
          年累计值: 1,
          环比: 0,
        },
      },
    },
    // "2025-02": {
    //   广投石化本部: {
    //     货币资金: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 15.51,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     金融资产: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1.48,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     其他应收: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 8.09,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     长期应收: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 0.11,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     资产占用: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 8.24,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     存货: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 26.87,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     应收款项: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 17.64,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     预付款项: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-01",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 5.57,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     占用下游客商资金: {
    //       组织名: "广投石化本部",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: -27.63,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //   },
    //   桂盛桂轩: {
    //     货币资金: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 0.26,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     金融资产: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     其他应收: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     长期应收: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     资产占用: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     存货: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0.09,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     应收款项: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 0.22,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     预付款项: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 2.25,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     占用下游客商资金: {
    //       组织名: "桂盛桂轩",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: -0.4,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //   },
    //   恒润公司: {
    //     货币资金: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     金融资产: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     其他应收: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     长期应收: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     资产占用: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     存货: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     应收款项: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     预付款项: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //     占用下游客商资金: {
    //       组织名: "恒润公司",
    //       数据时间: "2025-02",
    //       数据类型: "月度",
    //       当期计划值: 0,
    //       当期实际值: 1,
    //       年累计值: 1,
    //       环比: 0,
    //     },
    //   },
    // },
  },
};

// 层数较浅直接用json模拟树结构
// 较深则转用节点树 + k-v 表
const enterpriseRelationData = {
  石化板块: {
    广投石化: {
      广投石化本部: undefined,
      广投石化广东分公司: undefined,
      永盛仓储: undefined,
      广投石化舟山: undefined,
    },
    桂盛桂轩: undefined,
    开燃公司: undefined,
    恒润公司: undefined,
  },
};

const productRelationData = {
  成品油: {
    汽油: {
      "#92汽油": undefined,
      "#95汽油": undefined,
      "#98汽油": undefined,
    },
    柴油: {
      "#0柴油": undefined,
    },
  },
  原油: {
    原油产品: undefined,
  },
};
/**
 * 针对json模拟树结构进行深度优先搜索
 * @param data 数据
 * @param target 目标
 * @param mapper 映射函数
 * @returns 目标
 */
function dfsSearch(
  data: any,
  target: string,
  mapper?: (data: any) => any
): any {
  for (const key in data) {
    if (key === target) {
      const result = mapper ? mapper(data[key]) : data[key];
      return result;
    }
    if (typeof data[key] === "object") {
      const result = dfsSearch(data[key], target, mapper);
      if (result) {
        return result;
      }
    }
  }
  return null;
}

/**
 * 获取某个节点下属的所有叶子后代
 * @param data 数据
 * @param targetKey 目标
 * @returns 目标
 */
function getLeafNodes(data: any): any {
  let result: any[] = [];
  if (!data) {
    return result;
  }
  for (const key in data) {
    if (typeof data[key] === "object") {
      // 对每个子节点进行递归
      result = result.concat(getLeafNodes(data[key]));
    } else {
      result.push(key);
    }
  }
  return result;
}

export const businessStore = defineStore("business", () => {
  const businessInfo = ref([]);
  const businessInfoValue = computed(() => businessInfo.value);
  const businessReportMap = ref<Record<string, any>>({});

  // 模拟数据库
  const yearCache = ref<YearCache>();
  const monthCache = ref<MonthCache>();
  // 模拟库存数据表
  const storageYearCache = ref<StorageYearCache>();
  const storageMonthCache = ref<StorageMonthCache>();
  // 模拟合同数据表
  const contractYearCache = ref<ContractYearCache>();
  const contractMonthCache = ref<ContractMonthCache>();

  function getBusinessLocalCache(force: boolean = false) {
    // TODO 持久化
    // 先从localStorage中找，没有就初始化
    let cache = localStorage.getItem("business-local-database");
    if (!cache || force) {
      localStorage.setItem(
        "business-local-database",
        JSON.stringify(unref(initCache(revenueData)))
      );
      cache = localStorage.getItem("business-local-database") as string;
    } else {
      const cacheData = JSON.parse(cache);
      initCacheByData(cacheData.yearCache, cacheData.monthCache);
    }
    return JSON.parse(cache);
  }

  /**
   * 初始化业务数据库
   */
  function initLocalBusinessDatabase(force: boolean = false) {
    if (yearCache.value && monthCache.value) {
      // return;
      clearCache();
    }
    let cache = getBusinessLocalCache(force);
    yearCache.value = cache.yearCache;
    monthCache.value = cache.monthCache;
    console.log("初始化完毕", yearCache.value, monthCache.value);
  }

  // 初始化库存数据库
  function initLocalStorageDatabase() {
    if (storageYearCache.value && storageMonthCache.value) {
      // return;
      clearStorageCache();
    }
    const cache = initStorageCache();
    storageYearCache.value = cache.yearCache;
    storageMonthCache.value = cache.monthCache;
    // console.log(storageYearCache.value, storageMonthCache.value);
  }

  // 初始化合同数据库
  function initLocalContractDatabase() {
    if (contractYearCache.value && contractMonthCache.value) {
      // return;
      clearContractYearCache();
      clearContractMonthCache();
    }
    const cache = initContractCache();
    contractYearCache.value = cache.yearCache;
    contractMonthCache.value = cache.monthCache;
    // console.log(contractYearCache.value, contractMonthCache.value);
  }

  function getLocalStorageDatabase() {
    if (!storageYearCache.value || !storageMonthCache.value) {
      initLocalStorageDatabase();
    }
    return {
      yearCache: storageYearCache.value,
      monthCache: storageMonthCache.value,
    };
  }

  /**
   * 获取业态报表列表
   *
   */
  function getBusinessReportFormList(queryForm: any) {
    return new Promise<any>((resolve, reject) => {
      BusinessFormAPI.getBusinessReportFormList(queryForm)
        .then((res) => {
          if (!res) {
            reject("Please try again.");
            return;
          }
          const currentRecord = res["当前记录"];
          businessInfo.value = currentRecord;
          resolve(currentRecord);
        })
        .catch((error) => {
          reject(error);
        });
    });
  }

  /**
   * 获取业态报表数据
   *
   */
  function getBusinessReportMap(year: string, category: string, force = false) {
    return new Promise(async (resolve) => {
      if (!businessReportMap.value[year]) {
        businessReportMap.value[year] = {};
      }
      if (businessReportMap.value[year][category] && !force) {
        resolve(businessReportMap.value[year][category]);
        return;
      }
      const data: any = await BusinessFormAPI.getBusinessReportFormList({
        业务维度: category,
        类型集合: ["年"],
        状态集合: ["有效"],
        日期早于: `${year}-12-31`,
        日期晚于: `${year}-01-01`,
      });
      businessReportMap.value[year][year] = data["当前记录"]?.[0];
      resolve(businessReportMap.value[year][year]);
    });
  }

  /**
   * 获取产品类型包含关系
   *
   */
  function getProductRelation() {
    return new Promise<any>((resolve, reject) => {
      resolve(productRelationData);
    });
  }

  /**
   * 获取企业关系
   *
   */
  function getEnterpriseRelation() {
    return new Promise<any>((resolve, reject) => {
      resolve(enterpriseRelationData);
    });
  }

  /**
   * 获取某个组织的所有作为叶子节点的后代
   * 当前直接使用企业名在enterpriseRelationData中搜索
   * @param enterpriseId 企业ID
   */
  function getSubordinateEnterprise(enterpriseId: string) {
    return new Promise<any>((resolve, reject) => {
      // 使用dfs搜索
      const result = dfsSearch(enterpriseRelationData, enterpriseId, (data) => {
        return getLeafNodes(data, enterpriseId);
      });
      resolve(result);
    });
  }

  /**
   * 查询关键指标数据并根据企业关系进行拼装
   * @param keyIndex 关键指标
   * @param timeScale 时间维度
   * @param company 企业
   * @param fromYear 开始年份
   * @param toYear 结束年份
   * @param fromMonth 开始月份
   * @param toMonth 结束月份
   * @param category 业态, 和company至少一个
   * @param product 产品, 和company至少一个
   * @param withSubTimeData 是否查询子时段数据
   * @param withSubOrgData 是否查询下属企业数据
   * @param withSubProductData 是否查询下属产品数据
   * @param withSubProductTypeData 是否查询下属业态数据
   */
  function queryKeyIndexData(
    keyIndex: "营收" | "利润",
    timeScale: "年" | "月",
    company?: string,
    fromYear?: number,
    toYear?: number,
    fromMonth?: number,
    toMonth?: number,
    category?: string,
    product?: string,
    withSubTimeData?: boolean,
    withSubOrgData?: boolean,
    withSubProductData?: boolean,
    withSubProductTypeData?: boolean
  ): AggregatedData[] {
    return new Promise<any>((resolve, reject) => {
      // 如果缓存为空，则初始化缓存
      if (!yearCache.value || !monthCache.value) {
        initLocalBusinessDatabase();
      }

      // 如果不满足参数条件则返回空
      if (!company && !category && !product) {
        reject("请至少选择一个企业或业态或产品来查询");
        return;
      }
      // 根据时间维度，采用不同的默认参数
      if (timeScale === "年") {
        // from或to为空则采用当前年份1月到当前月份
        fromYear = fromYear || new Date().getFullYear();
        toYear = toYear || new Date().getFullYear();
        fromMonth = 1;
        toMonth = new Date().getMonth() + 1;
      }
      if (timeScale === "月") {
        // from或to为空则采用当前月份
        fromYear = fromYear || new Date().getFullYear();
        toYear = toYear || new Date().getFullYear();
        fromMonth = fromMonth || new Date().getMonth() + 1;
        toMonth = toMonth || new Date().getMonth() + 1;
      }
      // const result = getKeyIndexData(
      //   keyIndex,
      //   timeScale,
      //   fromYear!,
      //   toYear!,
      //   fromMonth!,
      //   toMonth!,
      //   company,
      //   category,
      //   product
      // );
      const result = queryAggData({
        keyIndexType: keyIndex,
        timeDimension: timeScale === "年" ? "year" : "month",
        org: company,
        productType: category,
        product: product,
        startDate:
          timeScale === "年"
            ? `${fromYear}`
            : `${fromYear}-${fromMonth!.toString().padStart(2, "0")}`,
        endDate:
          timeScale === "年"
            ? `${toYear}`
            : `${toYear}-${toMonth!.toString().padStart(2, "0")}`,
        withSubTimeData,
        withSubOrgData,
        withSubProductData,
        withSubProductTypeData,
      });
      resolve(result);
    });
  }

  function queryStorageData(
    timeScale: "年" | "月",
    company?: string,
    product?: string,
    productType?: string
  ) {
    if (!storageYearCache.value || !storageMonthCache.value) {
      initLocalStorageDatabase();
    }
    return new Promise<any>((resolve, reject) => {
      resolve(storageMonthCache.value);
    });
  }

  // service + controller
  /**
   * 查询合同数据
   * @param timeScale
   * @param company
   * @param product
   * @param productType
   * @returns
   */
  function queryContractData(
    timeScale: "年" | "月",
    dataTime: string,
    company?: string,
    contractType?: string
  ) {
    if (!contractYearCache.value || !contractMonthCache.value) {
      initLocalContractDatabase();
    }
    // console.log(contractYearCache.value, contractMonthCache.value);
    return new Promise<any>((resolve, reject) => {
      resolve(
        queryAggregateContractData(timeScale, dataTime, company, contractType)
      );
    });
  }

  return {
    queryForm,
    businessInfo,
    businessInfoValue,
    businessReportMap,
    getBusinessReportFormList,
    getBusinessReportMap,
    // 临时数据源
    getProductRelation,
    getEnterpriseRelation,
    getSubordinateEnterprise,
    queryKeyIndexData,
    queryStorageData,
    queryContractData,
    getLocalStorageDatabase,
    initLocalBusinessDatabase,
  };
});

/**
 * 用于在组件外部（如在Pinia Store 中）使用 Pinia 提供的 store 实例。
 * 官方文档解释了如何在组件外部使用 Pinia Store：
 * https://pinia.vuejs.org/core-concepts/outside-component-usage.html#using-a-store-outside-of-a-component
 */
export function businessStoreHook() {
  return businessStore(store);
}
